export const campuses = ["東広島", "霞", "東千田"]
export type Campus = typeof campuses[number]

export interface Kaisetsuki {
    rishuNenji: number
    semester: Semester
    jikiKubun: JikiKubun
}

// TODO 命名が最悪すぎる　「jigen」ってなんだ
export interface Jigen {
    youbi: "月" | "火" | "水" | "木" | "金" | "土" | "解析エラー"
    jigenRange: [begin: number, last: number] | "解析エラー"
    komaRange: [begin: number, last: number] | "解析エラー"
}


export interface Schedule {
    jikiKubun: JikiKubun  // 1ターム、2ターム、3ターム、4ターム、セメスター（前期）、セメスター（後期）、ターム外（前期）、ターム外（後期）、年度、通年、集中
    jigen: Jigen | undefined // 集中講義の場合はundefined // TODO: でよいのか？("集中"とする方法)
    rooms: string[]  // 何も書かれていない場合は空文字列, // TODO 本当は[string]のほうが良さそう
}

// TODO 「解析エラー」としているが、他に適切な書き方がありそう
export const semesters = ['前期', '後期'] as const;
export const jikiKubuns = ['１ターム', '２ターム', '３ターム', '４ターム', 'セメスター（前期）', 'セメスター（後期）', 'ターム外（前期）', 'ターム外（後期）', '年度', '通年', '集中'] as const

export type Semester = typeof semesters[number] | "解析エラー";
export type JikiKubun = typeof jikiKubuns[number] | "解析エラー";

export const kamokuKubuns = [
    "大学教育入門", "展開ゼミ", "平和科目", "外国語科目", "情報・データサイエンス科目", "領域科目", "基盤科目", "社会連携科目", "健康スポーツ科目", "専門教育科目", "教養教育科目（昼）", "教職専門科目", "教養教育科目（夜）", "他学部・他研究科科目", "大学院共通科目", "専門的教育科目"
] as const
export type KamokuKubun = typeof kamokuKubuns[number]

export const kaikouBukyokuGakubus = [
    "教養教育", "総合科学部", "総合科学部総合科学科", "総合科学部国際共創学科", "文学部", "教育学部", "法学部法学科昼間コース", "法学部法学科夜間主コース", "経済学部経済学科昼間コース", "経済学部経済学科夜間主コース", "理学部", "医学部", "医学部医学科", "医学部保健学科看護学専攻", "医学部保健学科理学療法学専攻", "医学部保健学科作業療法学専攻", "歯学部", "歯学部歯学科", "歯学部口腔健康科学科口腔保健学専攻", "歯学部口腔健康科学科口腔工学専攻", "薬学部", "薬学部薬学科", "薬学部薬科学科", "工学部", "生物生産学部", "情報科学部", "外国語教育研究センター", "情報メディア教育研究センター", "ダイバーシティ研究センター", "アクセシビリティセンター", "総合博物館", "森戸国際高等教育学院", "AI・データイノベーション教育研究センター",
] as const

export const kaikouBukyokuDaigakuins = [
    "大学院共通教育（博士課程前期）", "大学院共通教育（博士課程後期・博士課程）", "人間社会科学研究科博士課程前期", "人間社会科学研究科博士課程前期人文社会科学専攻人文学プログラム", "人間社会科学研究科博士課程前期人文社会科学専攻心理学プログラム", "人間社会科学研究科博士課程前期人文社会科学専攻法学・政治学プログラム", "人間社会科学研究科博士課程前期人文社会科学専攻経済学プログラム", "人間社会科学研究科博士課程前期人文社会科学専攻マネジメントプログラム", "人間社会科学研究科博士課程前期人文社会科学専攻国際平和共生プログラム", "人間社会科学研究科博士課程前期人文社会科学専攻国際経済開発プログラム", "人間社会科学研究科博士課程前期人文社会科学専攻人間総合科学プログラム", "人間社会科学研究科博士課程前期教育科学専攻教師教育デザイン学プログラム", "人間社会科学研究科博士課程前期教育科学専攻教育学プログラム", "人間社会科学研究科博士課程前期教育科学専攻日本語教育学プログラム", "人間社会科学研究科博士課程前期教育科学専攻国際教育開発プログラム", "人間社会科学研究科専門職学位課程教職開発専攻教職開発プログラム", "人間社会科学研究科専門職学位課程実務法学専攻実務法学プログラム", "人間社会科学研究科博士課程後期", "人間社会科学研究科博士課程後期人文社会科学専攻人文学プログラム", "人間社会科学研究科博士課程後期人文社会科学専攻心理学プログラム", "人間社会科学研究科博士課程後期人文社会科学専攻法学・政治学プログラム", "人間社会科学研究科博士課程後期人文社会科学専攻経済学プログラム", "人間社会科学研究科博士課程後期人文社会科学専攻国際平和共生プログラム", "人間社会科学研究科博士課程後期人文社会科学専攻国際経済開発プログラム", "人間社会科学研究科博士課程後期教育科学専攻教師教育デザイン学プログラム", "人間社会科学研究科博士課程後期教育科学専攻教育学プログラム", "人間社会科学研究科博士課程後期教育科学専攻日本語教育学プログラム", "人間社会科学研究科博士課程後期教育科学専攻国際教育開発プログラム", "人間社会科学研究科修士課程", "先進理工系科学研究科博士課程前期", "先進理工系科学研究科博士課程前期先進理工系科学専攻数学プログラム", "先進理工系科学研究科博士課程前期先進理工系科学専攻物理学プログラム", "先進理工系科学研究科博士課程前期先進理工系科学専攻地球惑星システム学プログラム", "先進理工系科学研究科博士課程前期先進理工系科学専攻応用化学プログラム", "先進理工系科学研究科博士課程前期先進理工系科学専攻化学工学プログラム", "先進理工系科学研究科博士課程前期先進理工系科学専攻電気システム制御プログラム", "先進理工系科学研究科博士課程前期先進理工系科学専攻機械工学プログラム", "先進理工系科学研究科博士課程前期先進理工系科学専攻輸送・環境システムプログラム", "先進理工系科学研究科博士課程前期先進理工系科学専攻建築学プログラム", "先進理工系科学研究科博士課程前期先進理工系科学専攻社会基盤環境工学プログラム", "先進理工系科学研究科博士課程前期先進理工系科学専攻情報科学プログラム", "先進理工系科学研究科博士課程前期先進理工系科学専攻量子物質科学プログラム", "先進理工系科学研究科博士課程前期先進理工系科学専攻理工学融合プログラム", "先進理工系科学研究科博士課程前期先進理工系科学専攻スマートイノベーションプログラム", "先進理工系科学研究科博士課程前期先進理工系科学専攻化学プログラム", "先進理工系科学研究科博士課程後期", "先進理工系科学研究科博士課程後期先進理工系科学専攻数学プログラム", "先進理工系科学研究科博士課程後期先進理工系科学専攻物理学プログラム", "先進理工系科学研究科博士課程後期先進理工系科学専攻地球惑星システム学プログラム", "先進理工系科学研究科博士課程後期先進理工系科学専攻応用化学プログラム", "先進理工系科学研究科博士課程後期先進理工系科学専攻化学工学プログラム", "先進理工系科学研究科博士課程後期先進理工系科学専攻電気システム制御プログラム", "先進理工系科学研究科博士課程後期先進理工系科学専攻機械工学プログラム", "先進理工系科学研究科博士課程後期先進理工系科学専攻輸送・環境システムプログラム", "先進理工系科学研究科博士課程後期先進理工系科学専攻建築学プログラム", "先進理工系科学研究科博士課程後期先進理工系科学専攻社会基盤環境工学プログラム", "先進理工系科学研究科博士課程後期先進理工系科学専攻情報科学プログラム", "先進理工系科学研究科博士課程後期先進理工系科学専攻量子物質科学プログラム", "先進理工系科学研究科博士課程後期先進理工系科学専攻理工学融合プログラム", "先進理工系科学研究科博士課程後期先進理工系科学専攻スマートイノベーションプログラム", "先進理工系科学研究科博士課程後期先進理工系科学専攻化学プログラム", "先進理工系科学研究科修士課程", "統合生命科学研究科博士課程前期", "統合生命科学研究科博士課程前期統合生命科学専攻生物工学プログラム", "統合生命科学研究科博士課程前期統合生命科学専攻食品生命科学プログラム", "統合生命科学研究科博士課程前期統合生命科学専攻生物資源科学プログラム", "統合生命科学研究科博士課程前期統合生命科学専攻生命環境総合科学プログラム", "統合生命科学研究科博士課程前期統合生命科学専攻基礎生物学プログラム", "統合生命科学研究科博士課程前期統合生命科学専攻数理生命科学プログラム", "統合生命科学研究科博士課程前期統合生命科学専攻生命医科学プログラム", "統合生命科学研究科博士課程後期", "統合生命科学研究科博士課程後期統合生命科学専攻基礎生物学プログラム", "統合生命科学研究科博士課程後期統合生命科学専攻数理生命科学プログラム", "統合生命科学研究科博士課程後期統合生命科学専攻生命医科学プログラム", "医系科学研究科博士課程", "医系科学研究科博士課程前期", "医系科学研究科博士課程後期", "スマートソサイエティ実践科学研究院博士課程前期", "スマートソサイエティ実践科学研究院博士課程後期", "特別支援教育特別専攻科", "森戸国際高等教育学院（大学院）", "教育本部（大学院）", "外国語教育研究センター（大学院）", "トランスレーショナル・リサーチセンター（大学院）", "ライティングセンター（大学院）", "AI・データイノベーション教育研究センター（大学院）", "教育学習支援センター（博士課程前期）", "教育学研究科博士課程後期", "理学研究科博士課程後期", "医歯薬保健学研究科博士課程後期"
] as const

export const kaikouBukyokus = [...kaikouBukyokuGakubus, ...kaikouBukyokuDaigakuins] as const

export type KaikouBukyokuGakubu = typeof kaikouBukyokuGakubus[number]
export type KaikouBukyokuDaigakuin = typeof kaikouBukyokuDaigakuins[number]
export type KaikouBukyoku = typeof kaikouBukyokus[number]

// tips: コロンは"："だったり" : "だったりするが、ここでは" : "に統一する
export const languages = ["J : 日本語", "E : 英語", "B : 日本語・英語", "O : その他"] as const
export type Language = typeof languages[number] | "解析エラー"

export type SubjectProperty =
    "relative URL" |
    "年度" |
    "開講部局" |
    "講義コード" |
    "科目区分" |
    "授業科目名" |
    "担当教員名" |
    "開講キャンパス" |
    "開設期" |
    "曜日・時限・講義室" |
    "単位" |
    "使用言語" |
    "教科書・参考書等" |
    "対象学生" |
    "授業の目標・概要等" |
    "予習・復習への アドバイス" |
    "履修上の注意 受講条件等	メッセージ" |
    "メッセージ" |
    "その他"


export type Subject = { [key in SubjectProperty]: string }

export type Subject2 = {
    "relative URL": string,
    "年度": string,
    "開講部局": KaikouBukyoku,
    "講義コード": string,
    "科目区分": KamokuKubun,
    "授業科目名": string,
    "担当教員名": [string],
    "開講キャンパス": Campus,
    "セメスター": Semester,
    "時期区分": JikiKubun,
    "履修年次": number,
    "授業時間・講義室": [Schedule],
    "開設期": string,
    "曜日・時限・講義室": string,
    "単位": string,
    "使用言語": Language,
    "教科書・参考書等": string,
    "対象学生": string,
    "授業の目標・概要等": string,
    "予習・復習への アドバイス": string,
    "履修上の注意 受講条件等	メッセージ": string,
    "メッセージ": string,
    "その他": string
}


export type SubjectMap = { [subjectCode: string]: Subject }